import 'package:places/domain/sight.dart';

final List mocks = [
  Sight(
      name: "Мечеть «Кул-Шариф»",
      url:
          "https://upload.wikimedia.org/wikipedia/commons/d/d1/Kazan_Kremlin_Qolsharif_Mosque_08-2016_img2.jpg?uselang=ru",
      details:
          "Главная соборная джума-мечеть республики Татарстан и города Казани (с 2005 года); расположена на территории Казанского кремля; одна из главных достопримечательностей города.",
      lat: 55.798298,
      lon: 49.105201,
      type: "Мечеть"),
  Sight(
      name: "Парк Тысячелетия",
      url: "https://cont.ws/uploads/pic/2016/4/0_80c1a_ee4ab833_orig.jpg",
      details:
          "Парк в Вахитовском районе Казани. Встречается также альтернативное название парка - «парк Миллениум».",
      lat: 55.783375,
      lon: 49.123695,
      type: "Парк"),
  Sight(
      name: "Apollo cafe",
      details:
          "Apollo cafe предлагает Вам самую раннюю доставку в городе Казань. Благодаря нам Вы сможете насладиться сытными завтраками и основными блюдами нашего кафе, не выходя из дома. Вам не придется тратить время на кухне. Мы готовим из свежих и вкусных продуктов, упаковываем каждое блюда так,чтобы заказ был доставлен еще горячим.",
      lat: 55.791827,
      lon: 49.136234,
      type: "Ресторан"),
  Sight(
      name: "Театр имени Г.Камала",
      url:
          "http://www.photokzn.ru/userfiles/pic640x340/img-20150420124517-890.jpg",
      details:
          "Татарский государственный академический театр имени Галиаскара Камала г. Казани, (Татарстан), на улице Татарстан и одноимённой площади.",
      lat: 55.7827008300091,
      lon: 49.11717827567945,
      type: "Театр")
];
